org/topics/eidas.org
:PROPERTIES:
:ID:       7b60c410-4f4c-4d72-ae47-790b43f71151
:END:
#+title: eIDAS

* In general
- eIDAS stands for "Electronic IDentification, Authentication and trust Services"
- eIDAS regulation provides a legal framework for digital signatures and electronic documents across EU member states.
- You can use an eIDAS-qualified electronic signature to sign PDF documents or other electronic documents.
- An eIDAS-qualified electronic signature has the same legal validity as a handwritten signature and is recognized in all EU member states.
* Resources
- 2023-04-20 ◦ [[https://www.bsi.bund.de/EN/Themen/Unternehmen-und-Organisationen/Standards-und-Zertifizierung/Technische-Richtlinien/TR-nach-Thema-sortiert/tr03125/BSITR03125.html][BSI - Bundesamt für Sicherheit in der Informationstechnik - BSI TR 03125 TR-ESOR Preservation of Evidence of Cryptographically Signed Document V. 1.2.2]]
- 2023-04-25 ◦ [[https://www.bundesnetzagentur.de/cln_121/EVD/DE/Uebersicht_eVD/start.html][Bundesnetzagentur - Übersicht aller elektronischen Vertrauensdienste]]
  - list of trusted providers in Germany
