content/topics/eidas.md
+++
title = "eIDAS"
draft = false
+++

## In general {#in-general}

-   eIDAS stands for "Electronic IDentification, Authentication and trust Services"
-   eIDAS regulation provides a legal framework for digital signatures and electronic documents across EU member states.
-   You can use an eIDAS-qualified electronic signature to sign PDF documents or other electronic documents.
-   An eIDAS-qualified electronic signature has the same legal validity as a handwritten signature and is recognized in all EU member states.


## Resources {#resources}

-   2023-04-20 ◦ [BSI - Bundesamt für Sicherheit in der Informationstechnik - BSI TR 03125 TR-ESOR Preservation of Evidence of Cryptographically Signed Document V. 1.2.2](https://www.bsi.bund.de/EN/Themen/Unternehmen-und-Organisationen/Standards-und-Zertifizierung/Technische-Richtlinien/TR-nach-Thema-sortiert/tr03125/BSITR03125.html)
-   2023-04-25 ◦ [Bundesnetzagentur - Übersicht aller elektronischen Vertrauensdienste](https://www.bundesnetzagentur.de/cln_121/EVD/DE/Uebersicht_eVD/start.html)
    -   list of trusted providers in Germany
